app/controllers/main_controller.rb

SELECT * FROM "photos"
---
  def pictures
    @photos = Photo.all