app/controllers/photos_controller.rb

SELECT * FROM "photos"
---
  def index
    @photos = Photo.all

SELECT * FROM "photos" WHERE ("photos"."id" = 1)
---
  def show
    @photo = Photo.find(params[:id])

SELECT * FROM "photos" WHERE ("photos"."id" = 1)
---
  def edit
    @photo = Photo.find(params[:id])

INSERT INTO "photos" ("name", "updated_at", "photo_file_name", "photo_file_size", "photo_updated_at", "photo_content_type", "created_at") VALUES('pic2', '2009-10-07 07:42:01', NULL, NULL, NULL, NULL, '2009-10-07 07:42:01')
---
  def create
    @photo = Photo.new(params[:photo])

    respond_to do |format|
      if @photo.save

SELECT * FROM "photos" WHERE ("photos"."id" = 1)
UPDATE "photos" SET "photo_content_type" = 'image/jpeg', "photo_file_name" = 'pic1_big.jpg', "photo_updated_at" = '2009-10-07 07:47:34', "photo_file_size" = 61504, "updated_at" = '2009-10-07 07:47:34' WHERE "id" = 1
---
  def update
    @photo = Photo.find(params[:id])

    respond_to do |format|
      if @photo.update_attributes(params[:photo])

SELECT * FROM "photos" WHERE ("photos"."id" = 3)
DELETE FROM "photos" WHERE "id" = 3
---
  def destroy
    @photo = Photo.find(params[:id])
    @photo.destroy