app/controllers/testimonials_controller.rb

  def index
    @testimonials = Testimonial.all
---
SELECT * FROM "testimonials"

  def show
    @testimonial = Testimonial.find(params[:id])
---
SELECT * FROM "testimonials" WHERE ("testimonials"."id" = 1)

  def create
    @testimonial = Testimonial.new(params[:testimonial])

    respond_to do |format|
      if @testimonial.save
---
INSERT INTO "testimonials" ("updated_at", "text", "from", "contact", "created_at") VALUES('2009-10-07 04:03:11', 'Elizabeth''s conduct of our ceremony far outweighed our expectations. She was extremely supportive and enthusiastic and gave us plenty of material to help us to prepare our unique ceremony. The ceremony involved the fusion of two cultures, it was relatively complicated, but Elizabeth managed to deliver the ceremony in a wonderfully relaxed manner. We put a lot of thought and love into the ceremony we prepared and were just thrilled with Elizabeth''s flair and professionalism in the delivery.', 'Parastou & Mark', 'Parastou & Mark', '2009-10-07 04:03:11')